information technology/database/mariadb/mariadb.org
* Installation
https://downloads.mariadb.org/mariadb/repositories/
#+BEGIN_SRC sh
yum install MariaDB-server Mariadb-client
systemctl enable mariadb.service
systemctl start mariadb.service
mysql -u root
#+END_SRC


* Sercurity
#+BEGIN_SRC sql
mysql_secure_installation
mysql -u root -p
      my-file
      [client]
      user=myusername
      password=mypassword
mysql --defaults-file=/path/to/my-file
#+END_SRC

* Administering MariaDB
The privileges or rights that we can grant to users break down into three main categories:
1. Global administrative user privileges
2. Database, table, and column user privileges
3. Miscellaneous user privileges and limits

Full documentation of the privileges:https://mariadb.com/kb/en/grant/

* Creating user
#+BEGIN_SRC sql
CREATE USER 'username'@'host' IDENTIFIED BY 'password';
#+END_SRC

#+BEGIN_SRC sql
CREATE USER 'boyd'@'%' IDENTIFIED BY 'bomber';
CREATE USER 'tom'@'localhost' IDENTIFIED BY 'retail';
CREATE USER 'richard'@'powr.example.net' IDENTIFIED BY 'nuclear';
CREATE USER 'robert'@'%.example.net' IDENTIFIED BY 'pilot';
CREATE USER 'dallin'@'192.168.1.1' IDENTIFIED BY 'judge';
CREATE USER 'russell'@'192.168.1.%' IDENTIFIED BY 'surgeon';
CREATE USER 'russell'@'192.168.1.0/255.255.255.0' IDENTIFIED BY 'business';

#+END_SRC
* Granting permissions
By default, new users do not have the permission to do anything except logging in, which is not very usefull.
#+BEGIN_SRC sql
GRANT <privileges> ON <database> TO <user>;
#+END_SRC
#+BEGIN_SRC sql
GRANT ALL ON *.* TO 'robert'@'%' WITH GRANT OPTION;
GRANT SELECT,INSERT,UPDATE,DELETE ON serv.* TO 'jeffrey'@'localhost';
GRANT SELECT ON edu.staff TO 'david'@'localhost' WITH GRANT OPTION;
The limit will apply to every database that can be accessed by the quentin user and not just to queries that the user runs on the logan database.
GRANT ALL ON logan.* TO 'quentin'@'localhost' WITH MAX_QUERIES_PER_HOUR 100;


#+END_SRC
