information-technology/database/mariadb/mariadb.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-10 Sun 01:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mike Chyson" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org84f8a12">1. Installation</a></li>
<li><a href="#orgfb80c62">2. Sercurity</a></li>
<li><a href="#org493dbcb">3. Administering MariaDB</a></li>
<li><a href="#org53f6489">4. Creating user</a></li>
<li><a href="#org80ec043">5. Granting permissions</a></li>
<li><a href="#orgff5d637">6. Revoking permissions</a></li>
<li><a href="#orgbbaa3fe">7. Showing permissions</a></li>
<li><a href="#org478f5ff">8. Setting and changing passwords</a></li>
<li><a href="#orge59176c">9. Removing users</a></li>
<li><a href="#org5e909c5">10. Using MariaDB</a>
<ul>
<li><a href="#org01ab6e3">10.1. Connecting to MariaDB</a></li>
<li><a href="#orgd893153">10.2. Using USE to select a database</a></li>
<li><a href="#org02b1458">10.3. Using SHOW to list all database</a></li>
<li><a href="#org8575bbb">10.4. Creating and deleting databases</a></li>
<li><a href="#org2d983b2">10.5. Creating a database</a></li>
<li><a href="#org7bbfce9">10.6. Deleting a database</a></li>
</ul>
</li>
<li><a href="#orgec4d0f6">11. Using CREATE TABLE</a>
<ul>
<li><a href="#org05fbf4e">11.1. Using CREATE TABLE - basic syntax</a></li>
<li><a href="#org04c10ff">11.2. Using CREATE TABLE - datatypes</a></li>
<li><a href="#orgbcef38c">11.3. Using CREATE TABLE - an example</a></li>
<li><a href="#orgcbb9820">11.4. Using SHOW to display the command used to create a table</a></li>
<li><a href="#org5d10941">11.5. Using DESCRIBE to explore the structure of a table</a></li>
</ul>
</li>
<li><a href="#orgccad47c">12. Using ALTER TABLE</a>
<ul>
<li><a href="#org1651eeb">12.1. Using ALTER TABLE - basic syntax</a></li>
<li><a href="#org53c7055">12.2. Using ALTER TABLE - adding a column</a></li>
<li><a href="#org50ed679">12.3. Using ALTER TABLE - modifying a column</a></li>
<li><a href="#org5e19f03">12.4. Using ALTER TABLE - droping a column</a></li>
<li><a href="#orgbf30533">12.5. Using DROP TABLE</a></li>
</ul>
</li>
<li><a href="#org837818e">13. Using MariaDB - Inserting, Updating, and Deleting</a>
<ul>
<li><a href="#org58f524e">13.1. Using INSERT</a></li>
<li><a href="#orgf3b8125">13.2. Using UPDATE</a></li>
<li><a href="#org8df1fe2">13.3. Using DELETE</a></li>
</ul>
</li>
<li><a href="#org6a0688d">14. Using MariaDB - Retrieving Data</a>
<ul>
<li><a href="#org3c7a846">14.1. basic syntax:</a></li>
<li><a href="#orgd22e55a">14.2. Retrieving everything</a></li>
<li><a href="#orgb950be0">14.3. Retrieving selected columns</a></li>
<li><a href="#org1e4df1c">14.4. Filtering and searching data</a></li>
<li><a href="#org30ac69c">14.5. Using logical operators</a></li>
<li><a href="#org3fdd8ec">14.6. Evaluation order</a></li>
<li><a href="#org32c44d2">14.7. Using the IN operator</a></li>
<li><a href="#org21f8fe5">14.8. Using the NOT operator</a></li>
<li><a href="#org4550f6b">14.9. Searching with LIKE</a></li>
<li><a href="#orgbb99832">14.10. Sorting data</a></li>
<li><a href="#orgd9e9869">14.11. Joining data</a></li>
</ul>
</li>
<li><a href="#org110694a">15. Summarizing data</a>
<ul>
<li><a href="#org28da5f4">15.1. The AVG function</a></li>
<li><a href="#org93bc1ca">15.2. The COUNT function</a></li>
<li><a href="#orgd526e85">15.3. The MIN and MAX functions</a></li>
<li><a href="#orgec8395f">15.4. The SUM function</a></li>
<li><a href="#org8b157c7">15.5. Using GROUP BY with summarized data</a></li>
<li><a href="#org5e34185">15.6. Using HAVING to filter GROUP BY</a></li>
</ul>
</li>
<li><a href="#org10c3155">16. Backing up, importing, and restoring data</a>
<ul>
<li><a href="#orgabc7c40">16.1. Basic backups with mysqldump</a></li>
<li><a href="#org2e5002d">16.2. Restoring backups made with mysqldump</a></li>
<li><a href="#org3c0c059">16.3. Making tab-delimited backups with mysqldump</a></li>
<li><a href="#org8023dfc">16.4. Restoring and importing data with mysqlimport</a></li>
<li><a href="#orgc635f1e">16.5. Making backups of MyISAM tables with mysqlhotcopy</a></li>
<li><a href="#org6867c0f">16.6. Making backups of XtraDB and InnoDB tables with xtrabackup</a></li>
<li><a href="#org8ab32a1">16.7. Restoring backups made with xtrabackup</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org84f8a12" class="outline-2">
<h2 id="org84f8a12"><span class="section-number-2">1</span> Installation</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://downloads.mariadb.org/mariadb/repositories/">https://downloads.mariadb.org/mariadb/repositories/</a><br />
</p>
<div class="org-src-container">
<pre class="src src-sh">yum install MariaDB-server Mariadb-client
systemctl enable mariadb.service
systemctl start mariadb.service
mysql -u root
</pre>
</div>
</div>
</div>


<div id="outline-container-orgfb80c62" class="outline-2">
<h2 id="orgfb80c62"><span class="section-number-2">2</span> Sercurity</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sql">mysql_secure_installation
mysql -u root -p
      my-file
      [client]
      <span style="color: #76ee00;">user</span>=myusername
      password=mypassword
mysql <span style="color: #cd853f;">--defaults-file=/path/to/my-file</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org493dbcb" class="outline-2">
<h2 id="org493dbcb"><span class="section-number-2">3</span> Administering MariaDB</h2>
<div class="outline-text-2" id="text-3">
<p>
The privileges or rights that we can grant to users break down into three main categories:<br />
</p>
<ol class="org-ol">
<li>Global administrative user privileges<br /></li>
<li>Database, table, and column user privileges<br /></li>
<li>Miscellaneous user privileges and limits<br /></li>
</ol>

<p>
Full documentation of the privileges:<a href="https://mariadb.com/kb/en/grant/">https://mariadb.com/kb/en/grant/</a><br />
</p>
</div>
</div>

<div id="outline-container-org53f6489" class="outline-2">
<h2 id="org53f6489"><span class="section-number-2">4</span> Creating user</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">CREATE</span> <span style="color: #76ee00;">USER</span> <span style="color: #ffa07a;">'username'</span>@<span style="color: #ffa07a;">'host'</span> IDENTIFIED <span style="color: #20b2aa; font-weight: bold;">BY</span> <span style="color: #ffa07a;">'password'</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">CREATE</span> <span style="color: #76ee00;">USER</span> <span style="color: #ffa07a;">'boyd'</span>@<span style="color: #ffa07a;">'%'</span> IDENTIFIED <span style="color: #20b2aa; font-weight: bold;">BY</span> <span style="color: #ffa07a;">'bomber'</span>;
<span style="color: #20b2aa; font-weight: bold;">CREATE</span> <span style="color: #76ee00;">USER</span> <span style="color: #ffa07a;">'tom'</span>@<span style="color: #ffa07a;">'localhost'</span> IDENTIFIED <span style="color: #20b2aa; font-weight: bold;">BY</span> <span style="color: #ffa07a;">'retail'</span>;
<span style="color: #20b2aa; font-weight: bold;">CREATE</span> <span style="color: #76ee00;">USER</span> <span style="color: #ffa07a;">'richard'</span>@<span style="color: #ffa07a;">'powr.example.net'</span> IDENTIFIED <span style="color: #20b2aa; font-weight: bold;">BY</span> <span style="color: #ffa07a;">'nuclear'</span>;
<span style="color: #20b2aa; font-weight: bold;">CREATE</span> <span style="color: #76ee00;">USER</span> <span style="color: #ffa07a;">'robert'</span>@<span style="color: #ffa07a;">'%.example.net'</span> IDENTIFIED <span style="color: #20b2aa; font-weight: bold;">BY</span> <span style="color: #ffa07a;">'pilot'</span>;
<span style="color: #20b2aa; font-weight: bold;">CREATE</span> <span style="color: #76ee00;">USER</span> <span style="color: #ffa07a;">'dallin'</span>@<span style="color: #ffa07a;">'192.168.1.1'</span> IDENTIFIED <span style="color: #20b2aa; font-weight: bold;">BY</span> <span style="color: #ffa07a;">'judge'</span>;
<span style="color: #20b2aa; font-weight: bold;">CREATE</span> <span style="color: #76ee00;">USER</span> <span style="color: #ffa07a;">'russell'</span>@<span style="color: #ffa07a;">'192.168.1.%'</span> IDENTIFIED <span style="color: #20b2aa; font-weight: bold;">BY</span> <span style="color: #ffa07a;">'surgeon'</span>;
<span style="color: #20b2aa; font-weight: bold;">CREATE</span> <span style="color: #76ee00;">USER</span> <span style="color: #ffa07a;">'russell'</span>@<span style="color: #ffa07a;">'192.168.1.0/255.255.255.0'</span> IDENTIFIED <span style="color: #20b2aa; font-weight: bold;">BY</span> <span style="color: #ffa07a;">'business'</span>;

</pre>
</div>
</div>
</div>
<div id="outline-container-org80ec043" class="outline-2">
<h2 id="org80ec043"><span class="section-number-2">5</span> Granting permissions</h2>
<div class="outline-text-2" id="text-5">
<p>
By default, new users do not have the permission to do anything except logging in, which is not very usefull.<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">GRANT</span> &lt;<span style="color: #20b2aa; font-weight: bold;">privileges</span>&gt; <span style="color: #20b2aa; font-weight: bold;">ON</span> &lt;database&gt; <span style="color: #20b2aa; font-weight: bold;">TO</span> &lt;<span style="color: #76ee00;">user</span>&gt;;
</pre>
</div>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">GRANT</span> <span style="color: #20b2aa; font-weight: bold;">ALL</span> <span style="color: #20b2aa; font-weight: bold;">ON</span> *.* <span style="color: #20b2aa; font-weight: bold;">TO</span> <span style="color: #ffa07a;">'robert'</span>@<span style="color: #ffa07a;">'%'</span> <span style="color: #20b2aa; font-weight: bold;">WITH</span> <span style="color: #20b2aa; font-weight: bold;">GRANT</span> <span style="color: #20b2aa; font-weight: bold;">OPTION</span>;
<span style="color: #20b2aa; font-weight: bold;">GRANT</span> <span style="color: #20b2aa; font-weight: bold;">SELECT</span>,<span style="color: #20b2aa; font-weight: bold;">INSERT</span>,<span style="color: #20b2aa; font-weight: bold;">UPDATE</span>,<span style="color: #20b2aa; font-weight: bold;">DELETE</span> <span style="color: #20b2aa; font-weight: bold;">ON</span> serv.* <span style="color: #20b2aa; font-weight: bold;">TO</span> <span style="color: #ffa07a;">'jeffrey'</span>@<span style="color: #ffa07a;">'localhost'</span>;
<span style="color: #20b2aa; font-weight: bold;">GRANT</span> <span style="color: #20b2aa; font-weight: bold;">SELECT</span> <span style="color: #20b2aa; font-weight: bold;">ON</span> edu.staff <span style="color: #20b2aa; font-weight: bold;">TO</span> <span style="color: #ffa07a;">'david'</span>@<span style="color: #ffa07a;">'localhost'</span> <span style="color: #20b2aa; font-weight: bold;">WITH</span> <span style="color: #20b2aa; font-weight: bold;">GRANT</span> <span style="color: #20b2aa; font-weight: bold;">OPTION</span>;
The <span style="color: #20b2aa; font-weight: bold;">limit</span> will apply <span style="color: #20b2aa; font-weight: bold;">to</span> <span style="color: #20b2aa; font-weight: bold;">every</span> database that can be accessed <span style="color: #20b2aa; font-weight: bold;">by</span> the quentin <span style="color: #76ee00;">user</span> <span style="color: #20b2aa; font-weight: bold;">and</span> <span style="color: #20b2aa; font-weight: bold;">not</span> just <span style="color: #20b2aa; font-weight: bold;">to</span> queries that the <span style="color: #76ee00;">user</span> runs <span style="color: #20b2aa; font-weight: bold;">on</span> the logan database.
<span style="color: #20b2aa; font-weight: bold;">GRANT</span> <span style="color: #20b2aa; font-weight: bold;">ALL</span> <span style="color: #20b2aa; font-weight: bold;">ON</span> logan.* <span style="color: #20b2aa; font-weight: bold;">TO</span> <span style="color: #ffa07a;">'quentin'</span>@<span style="color: #ffa07a;">'localhost'</span> <span style="color: #20b2aa; font-weight: bold;">WITH</span> MAX_QUERIES_PER_HOUR 100;


</pre>
</div>
</div>
</div>
