information technology/database/mariadb/mariadb.org
* Revoking permissions
to remove privileges
#+BEGIN_SRC sql
REVOKE <privileges> ON <database> FROM <user>;
#+END_SRC
#+BEGIN_SRC sql
REVOKE DELETE,GRANT OPTION ON cust.* FROM 'todd'@'%';
REVOKE ALL,GRANT OPTION FROM 'neil'@'%.example.com';
#+END_SRC

* Showing permissions
#+BEGIN_SRC sql
SHOW GRANTS FOR <user>;
#+END_SRC
#+BEGIN_SRC sql
SHOW GRANTS FOR 'dieter'@'10.2.200.4';
#+END_SRC


* Setting and changing passwords
#+BEGIN_SRC sql
SET PASSWORD FOR <user> = PASSWORD('<password>');
#+END_SRC
#+BEGIN_SRC sql
SET PASSWORD FOR 'henry'@'%' = PASSWORD('niftypassword');
#+END_SRC


* Removing users
#+BEGIN_SRC sql
DROP USER <user>;
#+END_SRC
#+BEGIN_SRC sql
DROP USER 'tom'@'%';
#+END_SRC



* Using MariaDB
** Connecting to MariaDB
#+BEGIN_SRC sql
mysql [-u <username>] [-p] [-h <host>] [<database>]
#+END_SRC

** Using USE to select a database
#+BEGIN_SRC sql
USE <database>
#+END_SRC
** Using SHOW to list all database
#+BEGIN_SRC sql
SHOW DATABASES;
#+END_SRC
** Creating and deleting databases
When MariaDB is installed, the installar creates four databases
mysql: to keep track of users
test: for experimentation and learning
performance_schema: semi-vritual database, read-only, stores performance
information_schema: semi-virtual database, read-only, stores other statistics

In MariaDB, a schema and a database are quite the same thing

** Creating a database
#+BEGIN_SRC sql
CREATE DATABASE <databasename>;
CREATE DATABASE my_database;
CREATE DATABASE IF NOT EXIST my_database;
#+END_SRC

** Deleting a database
#+BEGIN_SRC sql
DROP DATABASE <databasename>;
DROP DATABASE my_database;
DROP DATABASE IF EXIST my_database;
#+END_SRC

The process by which we refine our table definitions and split our data off into multiple tables is called normalization.
https://mariadb.com/kb/en/recap-the-relational-model

* Using CREATE TABLE
** Using CREATE TABLE - basic syntax 
#+BEGIN_EXAMPLE
basic CREATE TABLE table_name (<column_definition>);

The <column_definitions> part has the following basic syntax:
<column_name> <data_type>
[NOT NULL | NULL]
[DEFAULT <default_value>]
[AUTO_INCREMENT]
[UNIQUE [KEY] | [PRIMARY] KEY]
[COMMENT '<string>']
The parts in angle brakets(<>) are the bits that we fill in.
The parts in square brakets([]) are optional 
The pipe character(|) means "or"

#+END_EXAMPLE


** Using CREATE TABLE - datatypes 
Different datatypes exist because various types of data are most efficiently stored in different ways.
Common datatypes include numeric(numbers), strings(text), and dates.
numberic: INTEGER, FLOAT
string: CHAR, TEXT, VARCHAR
date: DATE,TIME,DATETIME

** Using CREATE TABLE - an example
#+BEGIN_SRC sql
CREATE TABLE employees (
id INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
surname VARCHAR(100),
givenname VARCHAR(100),
pref_name VARCHAR(50),
birthday DATE COMMENT 'approximate birthday OK'
);
#+END_SRC
** Using SHOW to display the command used to create a table
#+BEGIN_SRC sql
SHOW CREATE TABLE employee \G
SHOW CREATE TABLE employee;

#+END_SRC
** Using DESCRIBE to explore the structure of a table
#+BEGIN_SRC sql
DESCRIBE employees;  # COMMENT is not displayed
DESCRIBE employees birthday;  # specific column

#+END_SRC

* Using ALTER TABLE
** Using ALTER TABLE - basic syntax
#+BEGIN_SRC sql
ALTER TABLE table_name <alter_definition>[, alter_definition] ...;
#+END_SRC
The <alter_definition> part of the command can ADD, MODIFY, and DROP columns from tables.

