information-technology/database/mariadb/mariadb.html
<div id="outline-container-orgff5d637" class="outline-2">
<h2 id="orgff5d637"><span class="section-number-2">6</span> Revoking permissions</h2>
<div class="outline-text-2" id="text-6">
<p>
to remove privileges<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">REVOKE</span> &lt;<span style="color: #20b2aa; font-weight: bold;">privileges</span>&gt; <span style="color: #20b2aa; font-weight: bold;">ON</span> &lt;database&gt; <span style="color: #20b2aa; font-weight: bold;">FROM</span> &lt;<span style="color: #76ee00;">user</span>&gt;;
</pre>
</div>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">REVOKE</span> <span style="color: #20b2aa; font-weight: bold;">DELETE</span>,<span style="color: #20b2aa; font-weight: bold;">GRANT</span> <span style="color: #20b2aa; font-weight: bold;">OPTION</span> <span style="color: #20b2aa; font-weight: bold;">ON</span> cust.* <span style="color: #20b2aa; font-weight: bold;">FROM</span> <span style="color: #ffa07a;">'todd'</span>@<span style="color: #ffa07a;">'%'</span>;
<span style="color: #20b2aa; font-weight: bold;">REVOKE</span> <span style="color: #20b2aa; font-weight: bold;">ALL</span>,<span style="color: #20b2aa; font-weight: bold;">GRANT</span> <span style="color: #20b2aa; font-weight: bold;">OPTION</span> <span style="color: #20b2aa; font-weight: bold;">FROM</span> <span style="color: #ffa07a;">'neil'</span>@<span style="color: #ffa07a;">'%.example.com'</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbbaa3fe" class="outline-2">
<h2 id="orgbbaa3fe"><span class="section-number-2">7</span> Showing permissions</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-sql">SHOW GRANTS <span style="color: #20b2aa; font-weight: bold;">FOR</span> &lt;<span style="color: #76ee00;">user</span>&gt;;
</pre>
</div>
<div class="org-src-container">
<pre class="src src-sql">SHOW GRANTS <span style="color: #20b2aa; font-weight: bold;">FOR</span> <span style="color: #ffa07a;">'dieter'</span>@<span style="color: #ffa07a;">'10.2.200.4'</span>;
</pre>
</div>
</div>
</div>


<div id="outline-container-org478f5ff" class="outline-2">
<h2 id="org478f5ff"><span class="section-number-2">8</span> Setting and changing passwords</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">SET</span> PASSWORD <span style="color: #20b2aa; font-weight: bold;">FOR</span> &lt;<span style="color: #76ee00;">user</span>&gt; = PASSWORD(<span style="color: #ffa07a;">'&lt;password&gt;'</span>);
</pre>
</div>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">SET</span> PASSWORD <span style="color: #20b2aa; font-weight: bold;">FOR</span> <span style="color: #ffa07a;">'henry'</span>@<span style="color: #ffa07a;">'%'</span> = PASSWORD(<span style="color: #ffa07a;">'niftypassword'</span>);
</pre>
</div>
</div>
</div>


<div id="outline-container-orge59176c" class="outline-2">
<h2 id="orge59176c"><span class="section-number-2">9</span> Removing users</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">DROP</span> <span style="color: #76ee00;">USER</span> &lt;<span style="color: #76ee00;">user</span>&gt;;
</pre>
</div>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">DROP</span> <span style="color: #76ee00;">USER</span> <span style="color: #ffa07a;">'tom'</span>@<span style="color: #ffa07a;">'%'</span>;
</pre>
</div>
</div>
</div>



<div id="outline-container-org5e909c5" class="outline-2">
<h2 id="org5e909c5"><span class="section-number-2">10</span> Using MariaDB</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org01ab6e3" class="outline-3">
<h3 id="org01ab6e3"><span class="section-number-3">10.1</span> Connecting to MariaDB</h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">
<pre class="src src-sql">mysql [-u &lt;username&gt;] [-p] [-h &lt;<span style="color: #20b2aa; font-weight: bold;">host</span>&gt;] [&lt;database&gt;]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd893153" class="outline-3">
<h3 id="orgd893153"><span class="section-number-3">10.2</span> Using USE to select a database</h3>
<div class="outline-text-3" id="text-10-2">
<div class="org-src-container">
<pre class="src src-sql">USE &lt;database&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org02b1458" class="outline-3">
<h3 id="org02b1458"><span class="section-number-3">10.3</span> Using SHOW to list all database</h3>
<div class="outline-text-3" id="text-10-3">
<div class="org-src-container">
<pre class="src src-sql">SHOW DATABASES;
</pre>
</div>
</div>
</div>
<div id="outline-container-org8575bbb" class="outline-3">
<h3 id="org8575bbb"><span class="section-number-3">10.4</span> Creating and deleting databases</h3>
<div class="outline-text-3" id="text-10-4">
<p>
When MariaDB is installed, the installar creates four databases<br />
mysql: to keep track of users<br />
test: for experimentation and learning<br />
performance_schema: semi-vritual database, read-only, stores performance<br />
information_schema: semi-virtual database, read-only, stores other statistics<br />
</p>

<p>
In MariaDB, a schema and a database are quite the same thing<br />
</p>
</div>
</div>

<div id="outline-container-org2d983b2" class="outline-3">
<h3 id="org2d983b2"><span class="section-number-3">10.5</span> Creating a database</h3>
<div class="outline-text-3" id="text-10-5">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">CREATE</span> DATABASE &lt;databasename&gt;;
<span style="color: #20b2aa; font-weight: bold;">CREATE</span> DATABASE my_database;
<span style="color: #20b2aa; font-weight: bold;">CREATE</span> DATABASE IF <span style="color: #20b2aa; font-weight: bold;">NOT</span> EXIST my_database;
</pre>
</div>
</div>
</div>

<div id="outline-container-org7bbfce9" class="outline-3">
<h3 id="org7bbfce9"><span class="section-number-3">10.6</span> Deleting a database</h3>
<div class="outline-text-3" id="text-10-6">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">DROP</span> DATABASE &lt;databasename&gt;;
<span style="color: #20b2aa; font-weight: bold;">DROP</span> DATABASE my_database;
<span style="color: #20b2aa; font-weight: bold;">DROP</span> DATABASE IF EXIST my_database;
</pre>
</div>

<p>
The process by which we refine our table definitions and split our data off into multiple tables is called normalization.<br />
<a href="https://mariadb.com/kb/en/recap-the-relational-model">https://mariadb.com/kb/en/recap-the-relational-model</a><br />
</p>
</div>
</div>
</div>

<div id="outline-container-orgec4d0f6" class="outline-2">
<h2 id="orgec4d0f6"><span class="section-number-2">11</span> Using CREATE TABLE</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org05fbf4e" class="outline-3">
<h3 id="org05fbf4e"><span class="section-number-3">11.1</span> Using CREATE TABLE - basic syntax</h3>
<div class="outline-text-3" id="text-11-1">
<pre class="example">
basic CREATE TABLE table_name (&lt;column_definition&gt;);

The &lt;column_definitions&gt; part has the following basic syntax:
&lt;column_name&gt; &lt;data_type&gt;
[NOT NULL | NULL]
[DEFAULT &lt;default_value&gt;]
[AUTO_INCREMENT]
[UNIQUE [KEY] | [PRIMARY] KEY]
[COMMENT '&lt;string&gt;']
The parts in angle brakets(&lt;&gt;) are the bits that we fill in.
The parts in square brakets([]) are optional 
The pipe character(|) means "or"

</pre>
</div>
</div>


<div id="outline-container-org04c10ff" class="outline-3">
<h3 id="org04c10ff"><span class="section-number-3">11.2</span> Using CREATE TABLE - datatypes</h3>
<div class="outline-text-3" id="text-11-2">
<p>
Different datatypes exist because various types of data are most efficiently stored in different ways.<br />
Common datatypes include numeric(numbers), strings(text), and dates.<br />
numberic: INTEGER, FLOAT<br />
string: CHAR, TEXT, VARCHAR<br />
date: DATE,TIME,DATETIME<br />
</p>
</div>
</div>

<div id="outline-container-orgbcef38c" class="outline-3">
<h3 id="orgbcef38c"><span class="section-number-3">11.3</span> Using CREATE TABLE - an example</h3>
<div class="outline-text-3" id="text-11-3">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">CREATE</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> <span style="color: #00ff7f;">employees</span> (
id <span style="color: #9370db;">INT</span> <span style="color: #20b2aa; font-weight: bold;">NOT</span> <span style="color: #20b2aa; font-weight: bold;">NULL</span> AUTO_INCREMENT <span style="color: #20b2aa; font-weight: bold;">PRIMARY</span> <span style="color: #20b2aa; font-weight: bold;">KEY</span>,
surname <span style="color: #9370db;">VARCHAR</span>(100),
givenname <span style="color: #9370db;">VARCHAR</span>(100),
pref_name <span style="color: #9370db;">VARCHAR</span>(50),
birthday <span style="color: #9370db;">DATE</span> COMMENT <span style="color: #ffa07a;">'approximate birthday OK'</span>
);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcbb9820" class="outline-3">
<h3 id="orgcbb9820"><span class="section-number-3">11.4</span> Using SHOW to display the command used to create a table</h3>
<div class="outline-text-3" id="text-11-4">
<div class="org-src-container">
<pre class="src src-sql">SHOW <span style="color: #20b2aa; font-weight: bold;">CREATE</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> employee \G
SHOW <span style="color: #20b2aa; font-weight: bold;">CREATE</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> employee;

</pre>
</div>
</div>
</div>
<div id="outline-container-org5d10941" class="outline-3">
<h3 id="org5d10941"><span class="section-number-3">11.5</span> Using DESCRIBE to explore the structure of a table</h3>
<div class="outline-text-3" id="text-11-5">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">DESCRIBE</span> employees;  # COMMENT <span style="color: #20b2aa; font-weight: bold;">is</span> <span style="color: #20b2aa; font-weight: bold;">not</span> displayed
<span style="color: #20b2aa; font-weight: bold;">DESCRIBE</span> employees birthday;  # <span style="color: #20b2aa; font-weight: bold;">specific</span> <span style="color: #20b2aa; font-weight: bold;">column</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgccad47c" class="outline-2">
<h2 id="orgccad47c"><span class="section-number-2">12</span> Using ALTER TABLE</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org1651eeb" class="outline-3">
<h3 id="org1651eeb"><span class="section-number-3">12.1</span> Using ALTER TABLE - basic syntax</h3>
<div class="outline-text-3" id="text-12-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">ALTER</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> <span style="color: #20b2aa; font-weight: bold;">table_name</span> &lt;alter_definition&gt;[, alter_definition] ...;
</pre>
</div>
<p>
The &lt;alter_definition&gt; part of the command can ADD, MODIFY, and DROP columns from tables.<br />
</p>
</div>
</div>
