information technology/database/mariadb/mariadb.org
** Using ALTER TABLE - adding a column
#+BEGIN_SRC sql
ADD <column_name> <column_definition> [FIRST | AFTER <column_name>]
#+END_SRC

The FIRST option puts the new column as the first column of a row.
The after option lets us specify which column the new column appers after.
By default, the column will be added after the current last column.

#+BEGIN_SRC sql
ALTER TABLE employees ADD username VARCHAR(20) AFTER pref_name;
#+END_SRC

** Using ALTER TABLE - modifying a column
#+BEGIN_SRC sql
MODIFY <column_name> <column_definition>
ALTER TABLE employees MODIFY pref_name VARCHAR(25);
#+END_SRC

** Using ALTER TABLE - droping a column
#+BEGIN_SRC sql
DROP <column_name>
ALTER TABLE employees DROP username;
#+END_SRC

** Using DROP TABLE
#+BEGIN_SRC sql
DROP TABLE <table_name>
DROP TABLE mytable;
DROP TABLE IF EXISTS mytable;
#+END_SRC

* Using MariaDB - Inserting, Updating, and Deleting
** Using INSERT
#+BEGIN_SRC sql
INSERT [INTO] <table_name> [(<column_name>[, <column_name>, ...])] {VALUES | VALUE} ({expression> | DEFAULT}, ... )[,( ... ), ... ];
#+END_SRC

Inserting complete rows
#+BEGIN_SRC sql
INSERT INTO employees VALUES
(NULL, "Perry", "Lowell Tom", "Tom", "1988-08-05");
#+END_SRC

For auto-incremented columns, such as the id column in our employees table, we have to put something but we can't put in our own value because MariaDB handles that. So, we use NULL as a placeholder to let MariaDB know that we are not providing a value and then MariaDB provides its own value.
#+BEGIN_SRC sql
INSERT INTO employees VALUES
(NULL, "Pratt","Parley", NULL, NULL),
(NULL, "Snow","Eliza", NULL, NULL);
#+END_SRC

A better and safer method is to always specify the columns that we are inserting data into, even if it is every column in the table.

Inserting partial rows
#+BEGIN_SRC sql
INSERT INTO employees (surname,givenname) VALUES
("Taylor","John"),
("Woodruff","Wilford"),
("Snow","Lorenzo");
INSERT INTO employees (pref_name,givenname,surname,birthday) VALUES
("George","George Albert","Smith","1970-04-04");
INSERT employees (surname) VALUE ("McKay");  
#+END_SRC

VALUE because of the single column

Inserting from another table
#+BEGIN_SRC sql
INSERT [INTO] <table_1> [(<column_name>[, <column_name>,...])]
SELECT <column_name>[, <column_name>,...]
FROM <table_2>;
INSERT INTO employees (surname, givenname, birthday)
SELECT lastname, firstname, bday
FROM names;
#+END_SRC

Inserting from a file
default: tab separated columns file
basic format:
#+BEGIN_SRC sql
LOAD DATA [LOCAL] INFILE '<filename>'
INTO TABLE <tablename>
[(<column_name>[, <column_name>,...]];
#+END_SRC

suppose we have a file named new_employees ,which has three columns which correspond to the birthday , surname , and givenname columns in our employees table:
1971-08-09 Anderson Neil
1985-01-24 Christofferson Todd
#+BEGIN_SRC sql
LOAD DATA INFILE '/tmp/new_employees'
INTO TABLE employees
(birthday, surname, givenname);
#+END_SRC

** Using UPDATE
basic syntax:
#+BEGIN_SRC sql
UPDATE <table_name>
SET column_name1={expression|DEFAULT}
[, column_name2={expression|DEFAULT}] ...
[WHERE <where_conditions>];

UPDATE employees SET
pref_name = "John", birthday = "1958-11-01"
WHERE surname = "Taylor" AND givenname = "John";

UPDATE employees SET
pref_name = "Will", birthday = "1957-03-01"
WHERE surname="Woodruff";

UPDATE employees SET
birthday = "1964-04-03"
WHERE surname = "Snow";

UPDATE employees SET
birthday = "1975-04-12"
WHERE id = 2;
#+END_SRC

** Using DELETE
#+BEGIN_SRC sql
DELETE FROM <table_name> [WHERE <where_conditions>];
DELETE FROM employees
WHERE givenname="Spencer" AND surname="Kimball";
#+END_SRC

