information-technology/database/mariadb/mariadb.html

<div id="outline-container-org53c7055" class="outline-3">
<h3 id="org53c7055"><span class="section-number-3">12.2</span> Using ALTER TABLE - adding a column</h3>
<div class="outline-text-3" id="text-12-2">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">ADD</span> &lt;<span style="color: #20b2aa; font-weight: bold;">column_name</span>&gt; &lt;column_definition&gt; [<span style="color: #20b2aa; font-weight: bold;">FIRST</span> | <span style="color: #20b2aa; font-weight: bold;">AFTER</span> &lt;<span style="color: #20b2aa; font-weight: bold;">column_name</span>&gt;]
</pre>
</div>

<p>
The FIRST option puts the new column as the first column of a row.<br />
The after option lets us specify which column the new column appers after.<br />
By default, the column will be added after the current last column.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">ALTER</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> <span style="color: #00ff7f;">employees</span> <span style="color: #20b2aa; font-weight: bold;">ADD</span> username <span style="color: #9370db;">VARCHAR</span>(20) <span style="color: #20b2aa; font-weight: bold;">AFTER</span> pref_name;
</pre>
</div>
</div>
</div>

<div id="outline-container-org50ed679" class="outline-3">
<h3 id="org50ed679"><span class="section-number-3">12.3</span> Using ALTER TABLE - modifying a column</h3>
<div class="outline-text-3" id="text-12-3">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">MODIFY</span> &lt;<span style="color: #20b2aa; font-weight: bold;">column_name</span>&gt; &lt;column_definition&gt;
<span style="color: #20b2aa; font-weight: bold;">ALTER</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> <span style="color: #00ff7f;">employees</span> <span style="color: #20b2aa; font-weight: bold;">MODIFY</span> pref_name <span style="color: #9370db;">VARCHAR</span>(25);
</pre>
</div>
</div>
</div>

<div id="outline-container-org5e19f03" class="outline-3">
<h3 id="org5e19f03"><span class="section-number-3">12.4</span> Using ALTER TABLE - droping a column</h3>
<div class="outline-text-3" id="text-12-4">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">DROP</span> &lt;<span style="color: #20b2aa; font-weight: bold;">column_name</span>&gt;
<span style="color: #20b2aa; font-weight: bold;">ALTER</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> <span style="color: #00ff7f;">employees</span> <span style="color: #20b2aa; font-weight: bold;">DROP</span> username;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbf30533" class="outline-3">
<h3 id="orgbf30533"><span class="section-number-3">12.5</span> Using DROP TABLE</h3>
<div class="outline-text-3" id="text-12-5">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">DROP</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> &lt;<span style="color: #20b2aa; font-weight: bold;">table_name</span>&gt;
<span style="color: #20b2aa; font-weight: bold;">DROP</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> <span style="color: #00ff7f;">mytable</span>;
<span style="color: #20b2aa; font-weight: bold;">DROP</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> <span style="color: #00ff7f;">IF</span> <span style="color: #20b2aa; font-weight: bold;">EXISTS</span> mytable;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org837818e" class="outline-2">
<h2 id="org837818e"><span class="section-number-2">13</span> Using MariaDB - Inserting, Updating, and Deleting</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org58f524e" class="outline-3">
<h3 id="org58f524e"><span class="section-number-3">13.1</span> Using INSERT</h3>
<div class="outline-text-3" id="text-13-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">INSERT</span> [<span style="color: #20b2aa; font-weight: bold;">INTO</span>] &lt;<span style="color: #20b2aa; font-weight: bold;">table_name</span>&gt; [(&lt;<span style="color: #20b2aa; font-weight: bold;">column_name</span>&gt;[, &lt;<span style="color: #20b2aa; font-weight: bold;">column_name</span>&gt;, ...])] {<span style="color: #20b2aa; font-weight: bold;">VALUES</span> | <span style="color: #20b2aa; font-weight: bold;">VALUE</span>} ({expression&gt; | <span style="color: #20b2aa; font-weight: bold;">DEFAULT</span>}, ... )[,( ... ), ... ];
</pre>
</div>

<p>
Inserting complete rows<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">INSERT</span> <span style="color: #20b2aa; font-weight: bold;">INTO</span> employees <span style="color: #20b2aa; font-weight: bold;">VALUES</span>
(<span style="color: #20b2aa; font-weight: bold;">NULL</span>, "Perry", "Lowell Tom", "Tom", "1988-08-05");
</pre>
</div>

<p>
For auto-incremented columns, such as the id column in our employees table, we have to put something but we can't put in our own value because MariaDB handles that. So, we use NULL as a placeholder to let MariaDB know that we are not providing a value and then MariaDB provides its own value.<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">INSERT</span> <span style="color: #20b2aa; font-weight: bold;">INTO</span> employees <span style="color: #20b2aa; font-weight: bold;">VALUES</span>
(<span style="color: #20b2aa; font-weight: bold;">NULL</span>, "Pratt","Parley", <span style="color: #20b2aa; font-weight: bold;">NULL</span>, <span style="color: #20b2aa; font-weight: bold;">NULL</span>),
(<span style="color: #20b2aa; font-weight: bold;">NULL</span>, "Snow","Eliza", <span style="color: #20b2aa; font-weight: bold;">NULL</span>, <span style="color: #20b2aa; font-weight: bold;">NULL</span>);
</pre>
</div>

<p>
A better and safer method is to always specify the columns that we are inserting data into, even if it is every column in the table.<br />
</p>

<p>
Inserting partial rows<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">INSERT</span> <span style="color: #20b2aa; font-weight: bold;">INTO</span> employees (surname,givenname) <span style="color: #20b2aa; font-weight: bold;">VALUES</span>
("Taylor","John"),
("Woodruff","Wilford"),
("Snow","Lorenzo");
<span style="color: #20b2aa; font-weight: bold;">INSERT</span> <span style="color: #20b2aa; font-weight: bold;">INTO</span> employees (pref_name,givenname,surname,birthday) <span style="color: #20b2aa; font-weight: bold;">VALUES</span>
("George","George Albert","Smith","1970-04-04");
<span style="color: #20b2aa; font-weight: bold;">INSERT</span> employees (surname) <span style="color: #20b2aa; font-weight: bold;">VALUE</span> ("McKay");  
</pre>
</div>

<p>
VALUE because of the single column<br />
</p>

<p>
Inserting from another table<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">INSERT</span> [<span style="color: #20b2aa; font-weight: bold;">INTO</span>] &lt;table_1&gt; [(&lt;<span style="color: #20b2aa; font-weight: bold;">column_name</span>&gt;[, &lt;<span style="color: #20b2aa; font-weight: bold;">column_name</span>&gt;,...])]
<span style="color: #20b2aa; font-weight: bold;">SELECT</span> &lt;<span style="color: #20b2aa; font-weight: bold;">column_name</span>&gt;[, &lt;<span style="color: #20b2aa; font-weight: bold;">column_name</span>&gt;,...]
<span style="color: #20b2aa; font-weight: bold;">FROM</span> &lt;table_2&gt;;
<span style="color: #20b2aa; font-weight: bold;">INSERT</span> <span style="color: #20b2aa; font-weight: bold;">INTO</span> employees (surname, givenname, birthday)
<span style="color: #20b2aa; font-weight: bold;">SELECT</span> lastname, firstname, bday
<span style="color: #20b2aa; font-weight: bold;">FROM</span> <span style="color: #20b2aa; font-weight: bold;">names</span>;
</pre>
</div>

<p>
Inserting from a file<br />
default: tab separated columns file<br />
basic format:<br />
</p>
<div class="org-src-container">
<pre class="src src-sql">LOAD <span style="color: #20b2aa; font-weight: bold;">DATA</span> [<span style="color: #20b2aa; font-weight: bold;">LOCAL</span>] INFILE <span style="color: #ffa07a;">'&lt;filename&gt;'</span>
<span style="color: #20b2aa; font-weight: bold;">INTO</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> &lt;tablename&gt;
[(&lt;<span style="color: #20b2aa; font-weight: bold;">column_name</span>&gt;[, &lt;<span style="color: #20b2aa; font-weight: bold;">column_name</span>&gt;,...]];
</pre>
</div>

<p>
suppose we have a file named new_employees ,which has three columns which correspond to the birthday , surname , and givenname columns in our employees table:<br />
1971-08-09 Anderson Neil<br />
1985-01-24 Christofferson Todd<br />
</p>
<div class="org-src-container">
<pre class="src src-sql">LOAD <span style="color: #20b2aa; font-weight: bold;">DATA</span> INFILE <span style="color: #ffa07a;">'/tmp/new_employees'</span>
<span style="color: #20b2aa; font-weight: bold;">INTO</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> employees
(birthday, surname, givenname);
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf3b8125" class="outline-3">
<h3 id="orgf3b8125"><span class="section-number-3">13.2</span> Using UPDATE</h3>
<div class="outline-text-3" id="text-13-2">
<p>
basic syntax:<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">UPDATE</span> &lt;<span style="color: #20b2aa; font-weight: bold;">table_name</span>&gt;
<span style="color: #20b2aa; font-weight: bold;">SET</span> column_name1={expression|<span style="color: #20b2aa; font-weight: bold;">DEFAULT</span>}
[, column_name2={expression|<span style="color: #20b2aa; font-weight: bold;">DEFAULT</span>}] ...
[<span style="color: #20b2aa; font-weight: bold;">WHERE</span> &lt;where_conditions&gt;];

<span style="color: #20b2aa; font-weight: bold;">UPDATE</span> employees <span style="color: #20b2aa; font-weight: bold;">SET</span>
pref_name = "John", birthday = "1958-11-01"
<span style="color: #20b2aa; font-weight: bold;">WHERE</span> surname = "Taylor" <span style="color: #20b2aa; font-weight: bold;">AND</span> givenname = "John";

<span style="color: #20b2aa; font-weight: bold;">UPDATE</span> employees <span style="color: #20b2aa; font-weight: bold;">SET</span>
pref_name = "Will", birthday = "1957-03-01"
<span style="color: #20b2aa; font-weight: bold;">WHERE</span> surname="Woodruff";

<span style="color: #20b2aa; font-weight: bold;">UPDATE</span> employees <span style="color: #20b2aa; font-weight: bold;">SET</span>
birthday = "1964-04-03"
<span style="color: #20b2aa; font-weight: bold;">WHERE</span> surname = "Snow";

<span style="color: #20b2aa; font-weight: bold;">UPDATE</span> employees <span style="color: #20b2aa; font-weight: bold;">SET</span>
birthday = "1975-04-12"
<span style="color: #20b2aa; font-weight: bold;">WHERE</span> id = 2;
</pre>
</div>
</div>
</div>

<div id="outline-container-org8df1fe2" class="outline-3">
<h3 id="org8df1fe2"><span class="section-number-3">13.3</span> Using DELETE</h3>
<div class="outline-text-3" id="text-13-3">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">DELETE</span> <span style="color: #20b2aa; font-weight: bold;">FROM</span> &lt;<span style="color: #20b2aa; font-weight: bold;">table_name</span>&gt; [<span style="color: #20b2aa; font-weight: bold;">WHERE</span> &lt;where_conditions&gt;];
<span style="color: #20b2aa; font-weight: bold;">DELETE</span> <span style="color: #20b2aa; font-weight: bold;">FROM</span> employees
<span style="color: #20b2aa; font-weight: bold;">WHERE</span> givenname="Spencer" <span style="color: #20b2aa; font-weight: bold;">AND</span> surname="Kimball";
</pre>
</div>
</div>
</div>
</div>
