information technology/database/mariadb/mariadb.org
* Using MariaDB - Retrieving Data
** basic syntax:
#+BEGIN_SRC sql
SELECT <what> FROM <table_name>
[WHERE <where-conditions>]
[ORDER BY <column_name>];
#+END_SRC

** Retrieving everything
#+BEGIN_SRC sql
SELECT * FROM employees; 
#+END_SRC

the data will be retrieved and displayed in the order in which it is stored in the table.

** Retrieving selected columns
#+BEGIN_SRC sql
SELECT givenname,surname FROM employees;
#+END_SRC

** Filtering and searching data
Filtering by exact values
#+BEGIN_SRC sql
SELECT * FROM employees
WHERE birthday >= '1970-01-01';
#+END_SRC

** Using logical operators
Using the AND operator
#+BEGIN_SRC sql
SELECT * FROM employees
WHERE surname = 'Snow'
AND givenname LIKE 'Eli%';
#+END_SRC

Using the OR operator
#+BEGIN_SRC sql
SELECT * FROM employees
WHERE givenname = 'Neil'
OR givenname = 'John';
#+END_SRC

** Evaluation order
In SQL, AND operators are evaluated first, followed by the OR operations.
#+BEGIN_SRC sql
ELECT * FROM employees
WHERE 
givenname = 'John'
OR givenname = 'Tom'
AND surname = 'Snow';
ELECT * FROM employees
WHERE
(givenname = 'John'
OR givenname = 'Tom')
AND surname = 'Snow';
#+END_SRC

** Using the IN operator
#+BEGIN_SRC sql
SELECT * FROM employees
WHERE
surname = 'Snow'
OR surname = 'Smith'
OR surname = 'Pratt';
SELECT * FROM employees WHERE surname IN ('Snow','Smith','Pratt');
#+END_SRC

** Using the NOT operator
#+BEGIN_SRC sql
SELECT * FROM employees WHERE
surname NOT IN ('Snow','Smith','Pratt');
#+END_SRC

** Searching with LIKE
#+BEGIN_SRC sql
SELECT * FROM employees
WHERE surname LIKE "McK%";  
#+END_SRC
%: wildcard

** Sorting data
#+BEGIN_SRC sql
SELECT * FROM employees
WHERE birthday >= '1970-01-01'
ORDER BY surname;
SELECT * FROM employees
WHERE birthday >= '1970-01-01'
ORDER BY surname,givenname , birthday;
#+END_SRC

** Joining data
#+BEGIN_SRC sql
CREATE TABLE phone (
id serial PRIMARY KEY,
emp_id int,
type char(3),
cc int(4),
number bigint,
ext int);
SELECT surname,givenname,type,cc,number,ext
FROM employees JOIN phone
ON employees.id = phone.emp_id;
The first table specified in the FROM clause is called the left table, and the second is called the right table.
SELECT surname,givenname,type,cc,number,ext
FROM employees LEFT JOIN phone
ON employees.id = phone.emp_id;
#+END_SRC

* Summarizing data
** The AVG function
The AVG function is used for obtaining the average of the data in a column.
The CURDATE function doesn't take any arguments and when called, it simply returns the current date.
The TIMESTAMPDIFF function takes three arguments-the unit to count by and two dates, and then outputs the difference between the two. The unit is one of several time units, including MINUTE , HOUR , DAY , WEEK , MONTH , QUARTER , and YEAR .
#+BEGIN_SRC sql
SELECT AVG(TIMESTAMPDIFF(YEAR,birthday,CURDATE()))
FROM employees;
#+END_SRC

