information-technology/database/mariadb/mariadb.html

<div id="outline-container-org6a0688d" class="outline-2">
<h2 id="org6a0688d"><span class="section-number-2">14</span> Using MariaDB - Retrieving Data</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-org3c7a846" class="outline-3">
<h3 id="org3c7a846"><span class="section-number-3">14.1</span> basic syntax:</h3>
<div class="outline-text-3" id="text-14-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">SELECT</span> &lt;what&gt; <span style="color: #20b2aa; font-weight: bold;">FROM</span> &lt;<span style="color: #20b2aa; font-weight: bold;">table_name</span>&gt;
[<span style="color: #20b2aa; font-weight: bold;">WHERE</span> &lt;<span style="color: #20b2aa; font-weight: bold;">where</span>-conditions&gt;]
[<span style="color: #20b2aa; font-weight: bold;">ORDER</span> <span style="color: #20b2aa; font-weight: bold;">BY</span> &lt;<span style="color: #20b2aa; font-weight: bold;">column_name</span>&gt;];
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd22e55a" class="outline-3">
<h3 id="orgd22e55a"><span class="section-number-3">14.2</span> Retrieving everything</h3>
<div class="outline-text-3" id="text-14-2">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">SELECT</span> * <span style="color: #20b2aa; font-weight: bold;">FROM</span> employees; 
</pre>
</div>

<p>
the data will be retrieved and displayed in the order in which it is stored in the table.<br />
</p>
</div>
</div>

<div id="outline-container-orgb950be0" class="outline-3">
<h3 id="orgb950be0"><span class="section-number-3">14.3</span> Retrieving selected columns</h3>
<div class="outline-text-3" id="text-14-3">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">SELECT</span> givenname,surname <span style="color: #20b2aa; font-weight: bold;">FROM</span> employees;
</pre>
</div>
</div>
</div>

<div id="outline-container-org1e4df1c" class="outline-3">
<h3 id="org1e4df1c"><span class="section-number-3">14.4</span> Filtering and searching data</h3>
<div class="outline-text-3" id="text-14-4">
<p>
Filtering by exact values<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">SELECT</span> * <span style="color: #20b2aa; font-weight: bold;">FROM</span> employees
<span style="color: #20b2aa; font-weight: bold;">WHERE</span> birthday &gt;= <span style="color: #ffa07a;">'1970-01-01'</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org30ac69c" class="outline-3">
<h3 id="org30ac69c"><span class="section-number-3">14.5</span> Using logical operators</h3>
<div class="outline-text-3" id="text-14-5">
<p>
Using the AND operator<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">SELECT</span> * <span style="color: #20b2aa; font-weight: bold;">FROM</span> employees
<span style="color: #20b2aa; font-weight: bold;">WHERE</span> surname = <span style="color: #ffa07a;">'Snow'</span>
<span style="color: #20b2aa; font-weight: bold;">AND</span> givenname <span style="color: #20b2aa; font-weight: bold;">LIKE</span> <span style="color: #ffa07a;">'Eli%'</span>;
</pre>
</div>

<p>
Using the OR operator<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">SELECT</span> * <span style="color: #20b2aa; font-weight: bold;">FROM</span> employees
<span style="color: #20b2aa; font-weight: bold;">WHERE</span> givenname = <span style="color: #ffa07a;">'Neil'</span>
<span style="color: #20b2aa; font-weight: bold;">OR</span> givenname = <span style="color: #ffa07a;">'John'</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org3fdd8ec" class="outline-3">
<h3 id="org3fdd8ec"><span class="section-number-3">14.6</span> Evaluation order</h3>
<div class="outline-text-3" id="text-14-6">
<p>
In SQL, AND operators are evaluated first, followed by the OR operations.<br />
</p>
<div class="org-src-container">
<pre class="src src-sql">ELECT * <span style="color: #20b2aa; font-weight: bold;">FROM</span> employees
<span style="color: #20b2aa; font-weight: bold;">WHERE</span> 
givenname = <span style="color: #ffa07a;">'John'</span>
<span style="color: #20b2aa; font-weight: bold;">OR</span> givenname = <span style="color: #ffa07a;">'Tom'</span>
<span style="color: #20b2aa; font-weight: bold;">AND</span> surname = <span style="color: #ffa07a;">'Snow'</span>;
ELECT * <span style="color: #20b2aa; font-weight: bold;">FROM</span> employees
<span style="color: #20b2aa; font-weight: bold;">WHERE</span>
(givenname = <span style="color: #ffa07a;">'John'</span>
<span style="color: #20b2aa; font-weight: bold;">OR</span> givenname = <span style="color: #ffa07a;">'Tom'</span>)
<span style="color: #20b2aa; font-weight: bold;">AND</span> surname = <span style="color: #ffa07a;">'Snow'</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org32c44d2" class="outline-3">
<h3 id="org32c44d2"><span class="section-number-3">14.7</span> Using the IN operator</h3>
<div class="outline-text-3" id="text-14-7">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">SELECT</span> * <span style="color: #20b2aa; font-weight: bold;">FROM</span> employees
<span style="color: #20b2aa; font-weight: bold;">WHERE</span>
surname = <span style="color: #ffa07a;">'Snow'</span>
<span style="color: #20b2aa; font-weight: bold;">OR</span> surname = <span style="color: #ffa07a;">'Smith'</span>
<span style="color: #20b2aa; font-weight: bold;">OR</span> surname = <span style="color: #ffa07a;">'Pratt'</span>;
<span style="color: #20b2aa; font-weight: bold;">SELECT</span> * <span style="color: #20b2aa; font-weight: bold;">FROM</span> employees <span style="color: #20b2aa; font-weight: bold;">WHERE</span> surname <span style="color: #20b2aa; font-weight: bold;">IN</span> (<span style="color: #ffa07a;">'Snow'</span>,<span style="color: #ffa07a;">'Smith'</span>,<span style="color: #ffa07a;">'Pratt'</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-org21f8fe5" class="outline-3">
<h3 id="org21f8fe5"><span class="section-number-3">14.8</span> Using the NOT operator</h3>
<div class="outline-text-3" id="text-14-8">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">SELECT</span> * <span style="color: #20b2aa; font-weight: bold;">FROM</span> employees <span style="color: #20b2aa; font-weight: bold;">WHERE</span>
surname <span style="color: #20b2aa; font-weight: bold;">NOT</span> <span style="color: #20b2aa; font-weight: bold;">IN</span> (<span style="color: #ffa07a;">'Snow'</span>,<span style="color: #ffa07a;">'Smith'</span>,<span style="color: #ffa07a;">'Pratt'</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-org4550f6b" class="outline-3">
<h3 id="org4550f6b"><span class="section-number-3">14.9</span> Searching with LIKE</h3>
<div class="outline-text-3" id="text-14-9">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">SELECT</span> * <span style="color: #20b2aa; font-weight: bold;">FROM</span> employees
<span style="color: #20b2aa; font-weight: bold;">WHERE</span> surname <span style="color: #20b2aa; font-weight: bold;">LIKE</span> "McK%";  
</pre>
</div>
<p>
%: wildcard<br />
</p>
</div>
</div>

<div id="outline-container-orgbb99832" class="outline-3">
<h3 id="orgbb99832"><span class="section-number-3">14.10</span> Sorting data</h3>
<div class="outline-text-3" id="text-14-10">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">SELECT</span> * <span style="color: #20b2aa; font-weight: bold;">FROM</span> employees
<span style="color: #20b2aa; font-weight: bold;">WHERE</span> birthday &gt;= <span style="color: #ffa07a;">'1970-01-01'</span>
<span style="color: #20b2aa; font-weight: bold;">ORDER</span> <span style="color: #20b2aa; font-weight: bold;">BY</span> surname;
<span style="color: #20b2aa; font-weight: bold;">SELECT</span> * <span style="color: #20b2aa; font-weight: bold;">FROM</span> employees
<span style="color: #20b2aa; font-weight: bold;">WHERE</span> birthday &gt;= <span style="color: #ffa07a;">'1970-01-01'</span>
<span style="color: #20b2aa; font-weight: bold;">ORDER</span> <span style="color: #20b2aa; font-weight: bold;">BY</span> surname,givenname , birthday;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd9e9869" class="outline-3">
<h3 id="orgd9e9869"><span class="section-number-3">14.11</span> Joining data</h3>
<div class="outline-text-3" id="text-14-11">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">CREATE</span> <span style="color: #20b2aa; font-weight: bold;">TABLE</span> <span style="color: #00ff7f;">phone</span> (
id serial <span style="color: #20b2aa; font-weight: bold;">PRIMARY</span> <span style="color: #20b2aa; font-weight: bold;">KEY</span>,
emp_id <span style="color: #9370db;">int</span>,
<span style="color: #20b2aa; font-weight: bold;">type</span> <span style="color: #9370db;">char</span>(3),
cc <span style="color: #9370db;">int</span>(4),
<span style="color: #20b2aa; font-weight: bold;">number</span> bigint,
ext <span style="color: #9370db;">int</span>);
<span style="color: #20b2aa; font-weight: bold;">SELECT</span> surname,givenname,<span style="color: #20b2aa; font-weight: bold;">type</span>,cc,<span style="color: #20b2aa; font-weight: bold;">number</span>,ext
<span style="color: #20b2aa; font-weight: bold;">FROM</span> employees <span style="color: #20b2aa; font-weight: bold;">JOIN</span> phone
<span style="color: #20b2aa; font-weight: bold;">ON</span> employees.id = phone.emp_id;
The <span style="color: #20b2aa; font-weight: bold;">first</span> <span style="color: #20b2aa; font-weight: bold;">table</span> specified <span style="color: #20b2aa; font-weight: bold;">in</span> the <span style="color: #20b2aa; font-weight: bold;">FROM</span> clause <span style="color: #20b2aa; font-weight: bold;">is</span> <span style="color: #20b2aa; font-weight: bold;">called</span> the <span style="color: #20b2aa; font-weight: bold;">left</span> <span style="color: #20b2aa; font-weight: bold;">table</span>, <span style="color: #20b2aa; font-weight: bold;">and</span> the <span style="color: #20b2aa; font-weight: bold;">second</span> <span style="color: #20b2aa; font-weight: bold;">is</span> <span style="color: #20b2aa; font-weight: bold;">called</span> the <span style="color: #20b2aa; font-weight: bold;">right</span> <span style="color: #20b2aa; font-weight: bold;">table</span>.
<span style="color: #20b2aa; font-weight: bold;">SELECT</span> surname,givenname,<span style="color: #20b2aa; font-weight: bold;">type</span>,cc,<span style="color: #20b2aa; font-weight: bold;">number</span>,ext
<span style="color: #20b2aa; font-weight: bold;">FROM</span> employees <span style="color: #20b2aa; font-weight: bold;">LEFT</span> <span style="color: #20b2aa; font-weight: bold;">JOIN</span> phone
<span style="color: #20b2aa; font-weight: bold;">ON</span> employees.id = phone.emp_id;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org110694a" class="outline-2">
<h2 id="org110694a"><span class="section-number-2">15</span> Summarizing data</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-org28da5f4" class="outline-3">
<h3 id="org28da5f4"><span class="section-number-3">15.1</span> The AVG function</h3>
<div class="outline-text-3" id="text-15-1">
<p>
The AVG function is used for obtaining the average of the data in a column.<br />
The CURDATE function doesn't take any arguments and when called, it simply returns the current date.<br />
The TIMESTAMPDIFF function takes three arguments-the unit to count by and two dates, and then outputs the difference between the two. The unit is one of several time units, including MINUTE , HOUR , DAY , WEEK , MONTH , QUARTER , and YEAR .<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">SELECT</span> <span style="color: #76ee00;">AVG</span>(TIMESTAMPDIFF(<span style="color: #20b2aa; font-weight: bold;">YEAR</span>,birthday,CURDATE()))
<span style="color: #20b2aa; font-weight: bold;">FROM</span> employees;
</pre>
</div>
</div>
</div>
