information technology/database/mariadb/mariadb.org
** The COUNT function
#+BEGIN_SRC sql
SELECT COUNT(*) FROM employees;
SELECT COUNT(pref_name) FROM employees; 
#+END_SRC

to count how many do have a set preferred name

** The MIN and MAX functions
the oldest employee
#+BEGIN_SRC sql
SELECT * FROM employees
WHERE birthday = (SELECT MIN(birthday) from employees);
#+END_SRC

the youngest employee
#+BEGIN_SRC sql
SELECT * FROM employees
WHERE birthday = (SELECT MAX(birthday) FROM employees);
#+END_SRC

** The SUM function
#+BEGIN_SRC sql
SELECT SUM(TIMESTAMPDIFF(YEAR,birthday,CURDATE()))
FROM employees;
#+END_SRC

** Using GROUP BY with summarized data
to find out which surnames are the most popular
#+BEGIN_SRC sql
SELECT surname, COUNT(*)
FROM employees
GROUP BY surname;
#+END_SRC

** Using HAVING to filter GROUP BY
#+BEGIN_SRC sql
SELECT surname, COUNT(*)
FROM employees
GROUP BY surname
HAVING COUNT(*) > 1;

#+END_SRC

* Backing up, importing, and restoring data
** Basic backups with mysqldump
#+BEGIN_SRC sh
mysqldump [-u username] [-p] database_name [table_name]
mysqldump -r root -p test > test.sql
#+END_SRC

** Restoring backups made with mysqldump
#+BEGIN_SRC sh
mysql -u root -p test < test.sql
#+END_SRC

** Making tab-delimited backups with mysqldump
#+BEGIN_SRC sh
mysqldump --tab /tmp/ -u root -p test employees
#+END_SRC

When using this option, mysqldump will create two files. A tablename.sql
file with the SQL commands to recreate the table, and a tablename.txt file with the actual data in tab-delimited format.
The SQL file is owned by whichever user we used to run the mysqldump command. The TXT file, on the other hand, is owned by the mysql user, so whatever directory we specify needs to have permissions so that both users can write to it.

** Restoring and importing data with mysqlimport
#+BEGIN_SRC sh
mysqlimport [--local] [-u username] [-p] database_name filename
#+END_SRC

The filename attribute must be the name of the table we want to import into.

#+BEGIN_SRC sh
mysqlimport --local -u root -p test /tmp/employees.txt
#+END_SRC

** Making backups of MyISAM tables with mysqlhotcopy
The mysqlhotcopy backup program is actually a Perl script. It can take backups quickly, but only if our tables use the MyISAM or ARCHIVE storage engines.
An easy way to show the storage engines being used by the tables in our database is with the following SELECT statement:
#+BEGIN_SRC sql
SELECT TABLE_NAME,ENGINE
FROM information_schema.tables
WHERE TABLE_SCHEMA="test";
#+END_SRC

We can change test to the name of whichever database we want to check.
mysqlhotcopy db_name [/path/to/new_directory]
The default storage engine for MariaDB is InnoDB , so this script is less useful.

** Making backups of XtraDB and InnoDB tables with xtrabackup
The xtrabackup backup program is made specifically for use with XtraDB and InnoDB tables. It can take quick, full backups of our databases while MariaDB is running.
To take a backup, we do the following:

#+BEGIN_SRC sh
xtrabackup --backup --datadir=/var/lib/mysql/ --target-dir=/path/to/backup/
#+END_SRC

InnoDB and XtraDB tables are stored across several files, and backups made with xtrabackup are the same. This is why while taking a backup with xtrabackup , we specify a directory and not a file name with the --target-dir option.
After making a raw backup, we need to prepare the backup so that it can be restored if necessary.
xtrabackup --prepare --target-dir=/path/to/backup/
The first time that we run xtrabackup with the --prepare option, our backed up data will be cleaned up and put into a logical order. The second time that the --prepare option is used, xtrabackup will create some log files that help speed up restoring our data, if it turns out that we need to do that. Running --prepare a third, fourth, or any more number of times won't do anything, but is safe to do so in case we can't remember if we've run it for the second time.

** Restoring backups made with xtrabackup
The easiest way to restore from a backup made with xtrabackup is to use a utility, such as rsync or the cp command, to copy all the files in the backup directory to our MariaDB data directory. Before doing so, we must stop MariaDB and then run the rsync or cp command.
#+BEGIN_SRC sh
rsync -avP /path/to/backup/ /var/lib/mysql/
#+END_SRC

After the files are copied back to the MariaDB data directory, and before we start MariaDB, it's a good idea to make sure that the ownership of the files is correct.
#+BEGIN_SRC sh
chown -R mysql:mysql /var/lib/mysql/
#+END_SRC

