information-technology/database/mariadb/mariadb.html

<div id="outline-container-org93bc1ca" class="outline-3">
<h3 id="org93bc1ca"><span class="section-number-3">15.2</span> The COUNT function</h3>
<div class="outline-text-3" id="text-15-2">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">SELECT</span> <span style="color: #76ee00;">COUNT</span>(*) <span style="color: #20b2aa; font-weight: bold;">FROM</span> employees;
<span style="color: #20b2aa; font-weight: bold;">SELECT</span> <span style="color: #76ee00;">COUNT</span>(pref_name) <span style="color: #20b2aa; font-weight: bold;">FROM</span> employees; 
</pre>
</div>

<p>
to count how many do have a set preferred name<br />
</p>
</div>
</div>

<div id="outline-container-orgd526e85" class="outline-3">
<h3 id="orgd526e85"><span class="section-number-3">15.3</span> The MIN and MAX functions</h3>
<div class="outline-text-3" id="text-15-3">
<p>
the oldest employee<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">SELECT</span> * <span style="color: #20b2aa; font-weight: bold;">FROM</span> employees
<span style="color: #20b2aa; font-weight: bold;">WHERE</span> birthday = (<span style="color: #20b2aa; font-weight: bold;">SELECT</span> <span style="color: #76ee00;">MIN</span>(birthday) <span style="color: #20b2aa; font-weight: bold;">from</span> employees);
</pre>
</div>

<p>
the youngest employee<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">SELECT</span> * <span style="color: #20b2aa; font-weight: bold;">FROM</span> employees
<span style="color: #20b2aa; font-weight: bold;">WHERE</span> birthday = (<span style="color: #20b2aa; font-weight: bold;">SELECT</span> <span style="color: #76ee00;">MAX</span>(birthday) <span style="color: #20b2aa; font-weight: bold;">FROM</span> employees);
</pre>
</div>
</div>
</div>

<div id="outline-container-orgec8395f" class="outline-3">
<h3 id="orgec8395f"><span class="section-number-3">15.4</span> The SUM function</h3>
<div class="outline-text-3" id="text-15-4">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">SELECT</span> <span style="color: #76ee00;">SUM</span>(TIMESTAMPDIFF(<span style="color: #20b2aa; font-weight: bold;">YEAR</span>,birthday,CURDATE()))
<span style="color: #20b2aa; font-weight: bold;">FROM</span> employees;
</pre>
</div>
</div>
</div>

<div id="outline-container-org8b157c7" class="outline-3">
<h3 id="org8b157c7"><span class="section-number-3">15.5</span> Using GROUP BY with summarized data</h3>
<div class="outline-text-3" id="text-15-5">
<p>
to find out which surnames are the most popular<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">SELECT</span> surname, <span style="color: #76ee00;">COUNT</span>(*)
<span style="color: #20b2aa; font-weight: bold;">FROM</span> employees
<span style="color: #20b2aa; font-weight: bold;">GROUP</span> <span style="color: #20b2aa; font-weight: bold;">BY</span> surname;
</pre>
</div>
</div>
</div>

<div id="outline-container-org5e34185" class="outline-3">
<h3 id="org5e34185"><span class="section-number-3">15.6</span> Using HAVING to filter GROUP BY</h3>
<div class="outline-text-3" id="text-15-6">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">SELECT</span> surname, <span style="color: #76ee00;">COUNT</span>(*)
<span style="color: #20b2aa; font-weight: bold;">FROM</span> employees
<span style="color: #20b2aa; font-weight: bold;">GROUP</span> <span style="color: #20b2aa; font-weight: bold;">BY</span> surname
<span style="color: #20b2aa; font-weight: bold;">HAVING</span> <span style="color: #76ee00;">COUNT</span>(*) &gt; 1;

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org10c3155" class="outline-2">
<h2 id="org10c3155"><span class="section-number-2">16</span> Backing up, importing, and restoring data</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-orgabc7c40" class="outline-3">
<h3 id="orgabc7c40"><span class="section-number-3">16.1</span> Basic backups with mysqldump</h3>
<div class="outline-text-3" id="text-16-1">
<div class="org-src-container">
<pre class="src src-sh">mysqldump [-u username] [-p] database_name [table_name]
mysqldump -r root -p test &gt; test.sql
</pre>
</div>
</div>
</div>

<div id="outline-container-org2e5002d" class="outline-3">
<h3 id="org2e5002d"><span class="section-number-3">16.2</span> Restoring backups made with mysqldump</h3>
<div class="outline-text-3" id="text-16-2">
<div class="org-src-container">
<pre class="src src-sh">mysql -u root -p test &lt; test.sql
</pre>
</div>
</div>
</div>

<div id="outline-container-org3c0c059" class="outline-3">
<h3 id="org3c0c059"><span class="section-number-3">16.3</span> Making tab-delimited backups with mysqldump</h3>
<div class="outline-text-3" id="text-16-3">
<div class="org-src-container">
<pre class="src src-sh">mysqldump --tab /tmp/ -u root -p test employees
</pre>
</div>

<p>
When using this option, mysqldump will create two files. A tablename.sql<br />
file with the SQL commands to recreate the table, and a tablename.txt file with the actual data in tab-delimited format.<br />
The SQL file is owned by whichever user we used to run the mysqldump command. The TXT file, on the other hand, is owned by the mysql user, so whatever directory we specify needs to have permissions so that both users can write to it.<br />
</p>
</div>
</div>

<div id="outline-container-org8023dfc" class="outline-3">
<h3 id="org8023dfc"><span class="section-number-3">16.4</span> Restoring and importing data with mysqlimport</h3>
<div class="outline-text-3" id="text-16-4">
<div class="org-src-container">
<pre class="src src-sh">mysqlimport [--local] [-u username] [-p] database_name filename
</pre>
</div>

<p>
The filename attribute must be the name of the table we want to import into.<br />
</p>

<div class="org-src-container">
<pre class="src src-sh">mysqlimport --local -u root -p test /tmp/employees.txt
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc635f1e" class="outline-3">
<h3 id="orgc635f1e"><span class="section-number-3">16.5</span> Making backups of MyISAM tables with mysqlhotcopy</h3>
<div class="outline-text-3" id="text-16-5">
<p>
The mysqlhotcopy backup program is actually a Perl script. It can take backups quickly, but only if our tables use the MyISAM or ARCHIVE storage engines.<br />
An easy way to show the storage engines being used by the tables in our database is with the following SELECT statement:<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #20b2aa; font-weight: bold;">SELECT</span> <span style="color: #20b2aa; font-weight: bold;">TABLE_NAME</span>,ENGINE
<span style="color: #20b2aa; font-weight: bold;">FROM</span> information_schema.tables
<span style="color: #20b2aa; font-weight: bold;">WHERE</span> TABLE_SCHEMA="test";
</pre>
</div>

<p>
We can change test to the name of whichever database we want to check.<br />
mysqlhotcopy db_name [/path/to/new_directory]<br />
The default storage engine for MariaDB is InnoDB , so this script is less useful.<br />
</p>
</div>
</div>

<div id="outline-container-org6867c0f" class="outline-3">
<h3 id="org6867c0f"><span class="section-number-3">16.6</span> Making backups of XtraDB and InnoDB tables with xtrabackup</h3>
<div class="outline-text-3" id="text-16-6">
<p>
The xtrabackup backup program is made specifically for use with XtraDB and InnoDB tables. It can take quick, full backups of our databases while MariaDB is running.<br />
To take a backup, we do the following:<br />
</p>

<div class="org-src-container">
<pre class="src src-sh">xtrabackup --backup --datadir=/var/lib/mysql/ --target-dir=/path/to/backup/
</pre>
</div>

<p>
InnoDB and XtraDB tables are stored across several files, and backups made with xtrabackup are the same. This is why while taking a backup with xtrabackup , we specify a directory and not a file name with the &#x2013;target-dir option.<br />
After making a raw backup, we need to prepare the backup so that it can be restored if necessary.<br />
xtrabackup &#x2013;prepare &#x2013;target-dir=/path/to/backup/<br />
The first time that we run xtrabackup with the &#x2013;prepare option, our backed up data will be cleaned up and put into a logical order. The second time that the &#x2013;prepare option is used, xtrabackup will create some log files that help speed up restoring our data, if it turns out that we need to do that. Running &#x2013;prepare a third, fourth, or any more number of times won't do anything, but is safe to do so in case we can't remember if we've run it for the second time.<br />
</p>
</div>
</div>

<div id="outline-container-org8ab32a1" class="outline-3">
<h3 id="org8ab32a1"><span class="section-number-3">16.7</span> Restoring backups made with xtrabackup</h3>
<div class="outline-text-3" id="text-16-7">
<p>
The easiest way to restore from a backup made with xtrabackup is to use a utility, such as rsync or the cp command, to copy all the files in the backup directory to our MariaDB data directory. Before doing so, we must stop MariaDB and then run the rsync or cp command.<br />
</p>
<div class="org-src-container">
<pre class="src src-sh">rsync -avP /path/to/backup/ /var/lib/mysql/
</pre>
</div>

<p>
After the files are copied back to the MariaDB data directory, and before we start MariaDB, it's a good idea to make sure that the ownership of the files is correct.<br />
</p>
<div class="org-src-container">
<pre class="src src-sh">chown -R mysql:mysql /var/lib/mysql/
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mike Chyson</p>
<p class="date">Created: 2020-05-10 Sun 01:04</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
